app/views/flights/show.html.erb


<% if @flight.seats.length < @flight.capacity  then %>
---
SELECT "seats".* FROM "seats" WHERE "seats"."flight_id" = ?  [["flight_id", 1]]