app/controllers/seat_classes_controller.rb

SELECT "seat_classes".* FROM "seat_classes"
---
  def index
    @seat_classes = SeatClass.all

INSERT INTO "seat_classes" ("class_name", "price", "food_services", "seat_type", "leg_room", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @seat_class = SeatClass.new(seat_class_params)

    if @seat_class.class_name == "First Class" then
    	@seat_class.price = 1000
    	@seat_class.food_services = true
    	@seat_class.seat_type = "Recliner"
    	@seat_class.leg_room = "18 inches"
    elsif @seat_class.class_name == "Business Class" then
    	@seat_class.price = 700
    	@seat_class.food_services = true
    	@seat_class.seat_type = "Recliner"
    	@seat_class.leg_room = "12 inches"
    elsif @seat_class.class_name == "Economy Plus" then
    	@seat_class.price = 500
    	@seat_class.food_services = true
    	@seat_class.seat_type = "Bucket"
    	@seat_class.leg_room = "6 inches"
    elsif @seat_class.class_name == "Economy" then
    	@seat_class.price = 300
    	@seat_class.food_services = false
    	@seat_class.seat_type = "Bucket"
    	@seat_class.leg_room = "4 inches"
    end


    respond_to do |format|
      if @seat_class.save

SELECT  "seat_classes".* FROM "seat_classes" WHERE "seat_classes"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
    def set_seat_class
      @seat_class = SeatClass.find(params[:id])