app/models/seat.rb

SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "seats".* FROM "seats" WHERE "seats"."flight_id" = ?  [["flight_id", 1]]
---
	def check_capacity
		seats = Seat.where(flight_id: flight_id)
		capacity = Flight.find(flight_id).capacity

		if seats.length >= capacity  then

SELECT "seats".* FROM "seats" WHERE "seats"."flight_id" = ?  [["flight_id", 1]]
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def check_baggage
		seats = Seat.where(flight_id: flight_id)

		sum_baggage = 0

		seats.each do |s|
			sum_baggage += s.baggage.to_f
		end

		ba = Flight.find(flight_id).baggage_allowance